app/Controllers/Admin.php

    public function dashboard()
    {
        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'stats' => [
                'total_akomodasi' => $this->akomodasiModel->countAll(),
                'total_pemesanan' => $this->pemesananModel->countAll(),
                'total_users' => $this->userModel->where('role', 'pelanggan')->countAllResults(),
                'total_pegawai' => $this->userModel->where('role', 'pegawai')->countAllResults()
---
SELECT COUNT(*) AS `numrows` FROM `pemesanan`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'pelanggan'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'pegawai'

    public function akomodasi()
    {
        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'akomodasi' => $this->akomodasiModel->findAll()
---
SELECT *
FROM `akomodasi`

    public function tipeKamar($akomodasiId = null)
    {
        $builder = $this->tipeKamarModel->select('tipe_kamar.*, akomodasi.nama as nama_akomodasi')
                                        ->join('akomodasi', 'akomodasi.id = tipe_kamar.akomodasi_id');

        if ($akomodasiId) {
            $builder->where('akomodasi_id', $akomodasiId);
        }

        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'tipe_kamar' => $builder->findAll(),
---
SELECT `tipe_kamar`.*, `akomodasi`.`nama` as `nama_akomodasi`
FROM `tipe_kamar`
JOIN `akomodasi` ON `akomodasi`.`id` = `tipe_kamar`.`akomodasi_id`

    public function tipeKamarForm($id = null)
    {
        $tipeKamar = $id ? $this->tipeKamarModel->find($id) : null;

        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'tipe_kamar' => $tipeKamar,
            'akomodasi' => $this->akomodasiModel->findAll()
---
SELECT *
FROM `tipe_kamar`
WHERE `tipe_kamar`.`id` = '4'
SELECT *
FROM `akomodasi`

    public function tipeKamarSave()
    {
        $id = $this->request->getPost('id');

        $data = [
            'akomodasi_id' => $this->request->getPost('akomodasi_id'),
            'nama_tipe' => $this->request->getPost('nama_tipe'),
            'harga_per_malam' => $this->request->getPost('harga_per_malam'),
            'kapasitas' => $this->request->getPost('kapasitas'),
            'ukuran_kamar' => $this->request->getPost('ukuran_kamar'),
            'fasilitas_kamar' => $this->request->getPost('fasilitas_kamar'),
            'stok_kamar' => $this->request->getPost('stok_kamar'),
            'status' => $this->request->getPost('status') ?? 'available'
        ];

        // Handle foto upload
        $foto = $this->request->getFile('foto');
        if ($foto && $foto->isValid() && !$foto->hasMoved()) {
            $newName = $foto->getRandomName();
            $foto->move(FCPATH . 'uploads/akomodasi', $newName);
            $data['foto'] = $newName;
        }

        if ($id) {
            $this->tipeKamarModel->update($id, $data);
---
UPDATE `tipe_kamar` SET `akomodasi_id` = '1', `nama_tipe` = 'Deluxe Room', `harga_per_malam` = '850000.00', `kapasitas` = '2', `ukuran_kamar` = '32 m²', `fasilitas_kamar` = 'King Bed, TV LED 42\", AC, Mini Bar, Kamar Mandi Pribadi', `stok_kamar` = '10', `status` = 'maintenance', `foto` = '1768899140_0b34ad2ae60e09926009.jpg'
WHERE `tipe_kamar`.`id` IN ('4')

    public function users()
    {
        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'users' => $this->userModel->findAll()
---
SELECT *
FROM `users`

public function profilAdmin()
    {
        if (!$this->session->get('logged_in')) {
            return redirect()->to('auth/login');
        }

        $userId = $this->session->get('user_id');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '10'