app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'fitri@gmail.com'
 LIMIT 1
---
    public function processLogin()
    {
        $validation = \Config\Services::validation();

        $rules = [
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'Email harus diisi',
                    'valid_email' => 'Email tidak valid'
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Password harus diisi'
                ]
            ]
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();

INSERT INTO `users` (`nama`, `email`, `no_telp`, `password`, `role`, `created_at`, `updated_at`) VALUES ('Sayangku', 'hanhan@gmail.com', '6285727360656', '$2y$10$eW5784Q9H7kivfEMQja57.wcC9YBfJWdP4lKmNLo6/DBhfMm.7b1i', 'pelanggan', '2026-01-27 08:05:32', '2026-01-27 08:05:32')
---
            'role' => 'pelanggan' // Default role pelanggan
        ];

        $this->userModel->insert($data);