app/Controllers/Staff.php

    public function dashboard()
    {
        // Statistik harian
        $today = date('Y-m-d');

        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'pemesanan' => $this->pemesananModel->getAllPemesananWithDetails(),
            'stats' => [
                'pemesanan_hari_ini' => $this->pemesananModel->where('DATE(created_at)', $today)->countAllResults(),
                'checkin_hari_ini' => $this->pemesananModel->where('tanggal_checkin', $today)->where('status', 'check-in')->countAllResults(),
                'kamar_terpakai' => $this->pemesananModel->where('status', 'check-in')->countAllResults(),
                'pending' => $this->pemesananModel->where('status', 'pending')->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `tanggal_checkin` = '2026-02-04'
AND `status` = 'check-in'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `status` = 'check-in'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `status` = 'pending'

    public function detailPemesanan($id)
        {
            $pemesanan = $this->pemesananModel->getDetailPemesananFull($id);

            if (!$pemesanan) {
                throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
            }

            $tamu = $this->userModel->find($pemesanan['user_id']);

            $db = \Config\Database::connect();
            $statusLog = $db->table('pemesanan_status_log')
                ->select('pemesanan_status_log.*, users.nama as changed_by_name')
                ->join('users', 'users.id = pemesanan_status_log.changed_by', 'left')
                ->where('pemesanan_id', $id)
                ->orderBy('created_at', 'DESC')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '9'
SELECT `pemesanan_status_log`.*, `users`.`nama` as `changed_by_name`
FROM `pemesanan_status_log`
LEFT JOIN `users` ON `users`.`id` = `pemesanan_status_log`.`changed_by`
WHERE `pemesanan_id` = '17'
ORDER BY `created_at` DESC

    public function dataTamu()
    {
        $keyword = $this->request->getGet('search');

        $builder = $this->userModel;

        if ($keyword) {
            $builder = $builder->like('nama', $keyword)
                               ->orLike('email', $keyword)
                               ->orLike('no_telp', $keyword);
        }

        $tamu = $builder->where('role', 'pelanggan')->findAll();

        // Get pemesanan count for each tamu
        foreach ($tamu as &$t) {
            $t['total_pemesanan'] = $this->pemesananModel->where('user_id', $t['id'])->countAllResults();
        }

        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'tamu' => $tamu
        ];
---
SELECT *
FROM `users`
WHERE `role` = 'pelanggan'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `user_id` = '7'

    public function detailTamu($id)
    {
        $tamu = $this->userModel->find($id);

        if (!$tamu || $tamu['role'] != 'pelanggan') {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $pemesanan = $this->pemesananModel->getPemesananByUser($id);

        $data = [
            'user' => [
                'nama' => $this->session->get('nama'),
                'role' => $this->session->get('role')
            ],
            'tamu' => $tamu,
            'pemesanan' => $pemesanan
        ];
---
SELECT *
FROM `users`
WHERE `users`.`id` = '7'