app/Controllers/User.php

SELECT *
FROM `users`
WHERE `users`.`id` = '9'
---
    private function getCurrentUser()
    {
        if (!$this->session->get('logged_in')) {
            return null;
        }

        $userId = $this->session->get('user_id');
        if ($userId) {
            return $this->userModel->find($userId);