app/Models/PemesananModel.php

    public function getPemesananByUser($userId)
    {
        return $this->select('pemesanan.*, akomodasi.nama as nama_akomodasi, tipe_kamar.nama_tipe')
                    ->join('akomodasi', 'akomodasi.id = pemesanan.akomodasi_id')
                    ->join('tipe_kamar', 'tipe_kamar.id = pemesanan.tipe_kamar_id')
                    ->where('pemesanan.user_id', $userId)
                    ->orderBy('pemesanan.created_at', 'DESC')
                    ->findAll();
---
SELECT `pemesanan`.*, `akomodasi`.`nama` as `nama_akomodasi`, `tipe_kamar`.`nama_tipe`
FROM `pemesanan`
JOIN `akomodasi` ON `akomodasi`.`id` = `pemesanan`.`akomodasi_id`
JOIN `tipe_kamar` ON `tipe_kamar`.`id` = `pemesanan`.`tipe_kamar_id`
WHERE `pemesanan`.`user_id` = '7'
ORDER BY `pemesanan`.`created_at` DESC

    public function getDetailPemesananFull($id)
    {
        return $this->select('pemesanan.*,
                             akomodasi.nama as nama_akomodasi,
                             akomodasi.alamat,
                             akomodasi.kota,
                             tipe_kamar.nama_tipe,
                             tipe_kamar.harga_per_malam,
                             users.nama as nama_tamu,
                             users.email as email_tamu,
                             users.no_telp as no_telp_tamu')
                    ->join('akomodasi', 'akomodasi.id = pemesanan.akomodasi_id')
                    ->join('tipe_kamar', 'tipe_kamar.id = pemesanan.tipe_kamar_id')
                    ->join('users', 'users.id = pemesanan.user_id')
                    ->find($id);
---
SELECT `pemesanan`.*, `akomodasi`.`nama` as `nama_akomodasi`, `akomodasi`.`alamat`, `akomodasi`.`kota`, `tipe_kamar`.`nama_tipe`, `tipe_kamar`.`harga_per_malam`, `users`.`nama` as `nama_tamu`, `users`.`email` as `email_tamu`, `users`.`no_telp` as `no_telp_tamu`
FROM `pemesanan`
JOIN `akomodasi` ON `akomodasi`.`id` = `pemesanan`.`akomodasi_id`
JOIN `tipe_kamar` ON `tipe_kamar`.`id` = `pemesanan`.`tipe_kamar_id`
JOIN `users` ON `users`.`id` = `pemesanan`.`user_id`
WHERE `pemesanan`.`id` = '17'

    public function getAllPemesananWithDetails()
    {
        return $this->select('pemesanan.*,
                             akomodasi.nama as nama_akomodasi,
                             tipe_kamar.nama_tipe,
                             users.nama as nama_tamu,
                             users.email as email_tamu,
                             users.no_telp as no_telp_tamu')
                    ->join('akomodasi', 'akomodasi.id = pemesanan.akomodasi_id')
                    ->join('tipe_kamar', 'tipe_kamar.id = pemesanan.tipe_kamar_id')
                    ->join('users', 'users.id = pemesanan.user_id')
                    ->orderBy('pemesanan.created_at', 'DESC')
                    ->findAll();
---
SELECT `pemesanan`.*, `akomodasi`.`nama` as `nama_akomodasi`, `tipe_kamar`.`nama_tipe`, `users`.`nama` as `nama_tamu`, `users`.`email` as `email_tamu`, `users`.`no_telp` as `no_telp_tamu`
FROM `pemesanan`
JOIN `akomodasi` ON `akomodasi`.`id` = `pemesanan`.`akomodasi_id`
JOIN `tipe_kamar` ON `tipe_kamar`.`id` = `pemesanan`.`tipe_kamar_id`
JOIN `users` ON `users`.`id` = `pemesanan`.`user_id`
ORDER BY `pemesanan`.`created_at` DESC